XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/tzc_sec_reg.h
/**
  ******************************************************************************
  * @file    tzc_sec_reg.h
  * @version V1.0
  * @date    2021-07-20
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __TZC_SEC_REG_H__
#define __TZC_SEC_REG_H__

#include "bl606p.h"

/* 0x40 : tzc_rom_tzsrg_ctrl */
#define TZC_SEC_TZC_ROM_TZSRG_CTRL_OFFSET   (0x40)
#define TZC_SEC_TZC_ROM_TZSRG_R0_ID_EN      TZC_SEC_TZC_ROM_TZSRG_R0_ID_EN
#define TZC_SEC_TZC_ROM_TZSRG_R0_ID_EN_POS  (0U)
#define TZC_SEC_TZC_ROM_TZSRG_R0_ID_EN_LEN  (2U)
#define TZC_SEC_TZC_ROM_TZSRG_R0_ID_EN_MSK  (((1U << TZC_SEC_TZC_ROM_TZSRG_R0_ID_EN_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R0_ID_EN_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R0_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R0_ID_EN_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R0_ID_EN_POS))
#define TZC_SEC_TZC_ROM_TZSRG_R1_ID_EN      TZC_SEC_TZC_ROM_TZSRG_R1_ID_EN
#define TZC_SEC_TZC_ROM_TZSRG_R1_ID_EN_POS  (2U)
#define TZC_SEC_TZC_ROM_TZSRG_R1_ID_EN_LEN  (2U)
#define TZC_SEC_TZC_ROM_TZSRG_R1_ID_EN_MSK  (((1U << TZC_SEC_TZC_ROM_TZSRG_R1_ID_EN_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R1_ID_EN_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R1_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R1_ID_EN_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R1_ID_EN_POS))
#define TZC_SEC_TZC_ROM_TZSRG_R2_ID_EN      TZC_SEC_TZC_ROM_TZSRG_R2_ID_EN
#define TZC_SEC_TZC_ROM_TZSRG_R2_ID_EN_POS  (4U)
#define TZC_SEC_TZC_ROM_TZSRG_R2_ID_EN_LEN  (2U)
#define TZC_SEC_TZC_ROM_TZSRG_R2_ID_EN_MSK  (((1U << TZC_SEC_TZC_ROM_TZSRG_R2_ID_EN_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R2_ID_EN_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R2_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R2_ID_EN_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R2_ID_EN_POS))
#define TZC_SEC_TZC_ROM_TZSRG_R0_EN         TZC_SEC_TZC_ROM_TZSRG_R0_EN
#define TZC_SEC_TZC_ROM_TZSRG_R0_EN_POS     (16U)
#define TZC_SEC_TZC_ROM_TZSRG_R0_EN_LEN     (1U)
#define TZC_SEC_TZC_ROM_TZSRG_R0_EN_MSK     (((1U << TZC_SEC_TZC_ROM_TZSRG_R0_EN_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R0_EN_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R0_EN_UMSK    (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R0_EN_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R0_EN_POS))
#define TZC_SEC_TZC_ROM_TZSRG_R1_EN         TZC_SEC_TZC_ROM_TZSRG_R1_EN
#define TZC_SEC_TZC_ROM_TZSRG_R1_EN_POS     (17U)
#define TZC_SEC_TZC_ROM_TZSRG_R1_EN_LEN     (1U)
#define TZC_SEC_TZC_ROM_TZSRG_R1_EN_MSK     (((1U << TZC_SEC_TZC_ROM_TZSRG_R1_EN_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R1_EN_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R1_EN_UMSK    (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R1_EN_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R1_EN_POS))
#define TZC_SEC_TZC_ROM_TZSRG_R2_EN         TZC_SEC_TZC_ROM_TZSRG_R2_EN
#define TZC_SEC_TZC_ROM_TZSRG_R2_EN_POS     (18U)
#define TZC_SEC_TZC_ROM_TZSRG_R2_EN_LEN     (1U)
#define TZC_SEC_TZC_ROM_TZSRG_R2_EN_MSK     (((1U << TZC_SEC_TZC_ROM_TZSRG_R2_EN_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R2_EN_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R2_EN_UMSK    (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R2_EN_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R2_EN_POS))
#define TZC_SEC_TZC_ROM_TZSRG_R0_LOCK       TZC_SEC_TZC_ROM_TZSRG_R0_LOCK
#define TZC_SEC_TZC_ROM_TZSRG_R0_LOCK_POS   (24U)
#define TZC_SEC_TZC_ROM_TZSRG_R0_LOCK_LEN   (1U)
#define TZC_SEC_TZC_ROM_TZSRG_R0_LOCK_MSK   (((1U << TZC_SEC_TZC_ROM_TZSRG_R0_LOCK_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R0_LOCK_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R0_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R0_LOCK_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R0_LOCK_POS))
#define TZC_SEC_TZC_ROM_TZSRG_R1_LOCK       TZC_SEC_TZC_ROM_TZSRG_R1_LOCK
#define TZC_SEC_TZC_ROM_TZSRG_R1_LOCK_POS   (25U)
#define TZC_SEC_TZC_ROM_TZSRG_R1_LOCK_LEN   (1U)
#define TZC_SEC_TZC_ROM_TZSRG_R1_LOCK_MSK   (((1U << TZC_SEC_TZC_ROM_TZSRG_R1_LOCK_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R1_LOCK_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R1_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R1_LOCK_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R1_LOCK_POS))
#define TZC_SEC_TZC_ROM_TZSRG_R2_LOCK       TZC_SEC_TZC_ROM_TZSRG_R2_LOCK
#define TZC_SEC_TZC_ROM_TZSRG_R2_LOCK_POS   (26U)
#define TZC_SEC_TZC_ROM_TZSRG_R2_LOCK_LEN   (1U)
#define TZC_SEC_TZC_ROM_TZSRG_R2_LOCK_MSK   (((1U << TZC_SEC_TZC_ROM_TZSRG_R2_LOCK_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R2_LOCK_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R2_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R2_LOCK_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R2_LOCK_POS))
#define TZC_SEC_TZC_SBOOT_DONE              TZC_SEC_TZC_SBOOT_DONE
#define TZC_SEC_TZC_SBOOT_DONE_POS          (28U)
#define TZC_SEC_TZC_SBOOT_DONE_LEN          (4U)
#define TZC_SEC_TZC_SBOOT_DONE_MSK          (((1U << TZC_SEC_TZC_SBOOT_DONE_LEN) - 1) << TZC_SEC_TZC_SBOOT_DONE_POS)
#define TZC_SEC_TZC_SBOOT_DONE_UMSK         (~(((1U << TZC_SEC_TZC_SBOOT_DONE_LEN) - 1) << TZC_SEC_TZC_SBOOT_DONE_POS))

/* 0x44 : tzc_rom_tzsrg_adr_mask */
#define TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_OFFSET    (0x44)
#define TZC_SEC_TZC_ROM_TZSRG_ADR_MASK           TZC_SEC_TZC_ROM_TZSRG_ADR_MASK
#define TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_POS       (0U)
#define TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_LEN       (10U)
#define TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_MSK       (((1U << TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_POS)
#define TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_UMSK      (~(((1U << TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_POS))
#define TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_LOCK      TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_LOCK
#define TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_LOCK_POS  (16U)
#define TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_LOCK_LEN  (1U)
#define TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_LOCK_MSK  (((1U << TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_LOCK_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_LOCK_POS)
#define TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_LOCK_UMSK (~(((1U << TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_LOCK_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_ADR_MASK_LOCK_POS))

/* 0x48 : tzc_rom_tzsrg_r0 */
#define TZC_SEC_TZC_ROM_TZSRG_R0_OFFSET     (0x48)
#define TZC_SEC_TZC_ROM_TZSRG_R0_END        TZC_SEC_TZC_ROM_TZSRG_R0_END
#define TZC_SEC_TZC_ROM_TZSRG_R0_END_POS    (0U)
#define TZC_SEC_TZC_ROM_TZSRG_R0_END_LEN    (10U)
#define TZC_SEC_TZC_ROM_TZSRG_R0_END_MSK    (((1U << TZC_SEC_TZC_ROM_TZSRG_R0_END_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R0_END_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R0_END_UMSK   (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R0_END_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R0_END_POS))
#define TZC_SEC_TZC_ROM_TZSRG_R0_START      TZC_SEC_TZC_ROM_TZSRG_R0_START
#define TZC_SEC_TZC_ROM_TZSRG_R0_START_POS  (16U)
#define TZC_SEC_TZC_ROM_TZSRG_R0_START_LEN  (10U)
#define TZC_SEC_TZC_ROM_TZSRG_R0_START_MSK  (((1U << TZC_SEC_TZC_ROM_TZSRG_R0_START_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R0_START_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R0_START_UMSK (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R0_START_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R0_START_POS))

/* 0x4C : tzc_rom_tzsrg_r1 */
#define TZC_SEC_TZC_ROM_TZSRG_R1_OFFSET     (0x4C)
#define TZC_SEC_TZC_ROM_TZSRG_R1_END        TZC_SEC_TZC_ROM_TZSRG_R1_END
#define TZC_SEC_TZC_ROM_TZSRG_R1_END_POS    (0U)
#define TZC_SEC_TZC_ROM_TZSRG_R1_END_LEN    (10U)
#define TZC_SEC_TZC_ROM_TZSRG_R1_END_MSK    (((1U << TZC_SEC_TZC_ROM_TZSRG_R1_END_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R1_END_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R1_END_UMSK   (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R1_END_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R1_END_POS))
#define TZC_SEC_TZC_ROM_TZSRG_R1_START      TZC_SEC_TZC_ROM_TZSRG_R1_START
#define TZC_SEC_TZC_ROM_TZSRG_R1_START_POS  (16U)
#define TZC_SEC_TZC_ROM_TZSRG_R1_START_LEN  (10U)
#define TZC_SEC_TZC_ROM_TZSRG_R1_START_MSK  (((1U << TZC_SEC_TZC_ROM_TZSRG_R1_START_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R1_START_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R1_START_UMSK (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R1_START_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R1_START_POS))

/* 0x50 : tzc_rom_tzsrg_r2 */
#define TZC_SEC_TZC_ROM_TZSRG_R2_OFFSET     (0x50)
#define TZC_SEC_TZC_ROM_TZSRG_R2_END        TZC_SEC_TZC_ROM_TZSRG_R2_END
#define TZC_SEC_TZC_ROM_TZSRG_R2_END_POS    (0U)
#define TZC_SEC_TZC_ROM_TZSRG_R2_END_LEN    (10U)
#define TZC_SEC_TZC_ROM_TZSRG_R2_END_MSK    (((1U << TZC_SEC_TZC_ROM_TZSRG_R2_END_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R2_END_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R2_END_UMSK   (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R2_END_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R2_END_POS))
#define TZC_SEC_TZC_ROM_TZSRG_R2_START      TZC_SEC_TZC_ROM_TZSRG_R2_START
#define TZC_SEC_TZC_ROM_TZSRG_R2_START_POS  (16U)
#define TZC_SEC_TZC_ROM_TZSRG_R2_START_LEN  (10U)
#define TZC_SEC_TZC_ROM_TZSRG_R2_START_MSK  (((1U << TZC_SEC_TZC_ROM_TZSRG_R2_START_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R2_START_POS)
#define TZC_SEC_TZC_ROM_TZSRG_R2_START_UMSK (~(((1U << TZC_SEC_TZC_ROM_TZSRG_R2_START_LEN) - 1) << TZC_SEC_TZC_ROM_TZSRG_R2_START_POS))

/* 0x54 : tzc_rom_tzsrg_r3 */
#define TZC_SEC_TZC_ROM_TZSRG_R3_OFFSET (0x54)

