XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/tzc_sec_reg.h
/* 0x14C : tzc_ocram_tzsrg_r1 */
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_OFFSET     (0x14C)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_END        TZC_SEC_TZC_OCRAM_TZSRG_R1_END
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_END_POS    (0U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_END_LEN    (10U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_END_MSK    (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R1_END_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R1_END_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_END_UMSK   (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R1_END_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R1_END_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_START      TZC_SEC_TZC_OCRAM_TZSRG_R1_START
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_START_POS  (16U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_START_LEN  (10U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_START_MSK  (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R1_START_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R1_START_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R1_START_UMSK (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R1_START_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R1_START_POS))

/* 0x150 : tzc_ocram_tzsrg_r2 */
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_OFFSET     (0x150)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_END        TZC_SEC_TZC_OCRAM_TZSRG_R2_END
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_END_POS    (0U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_END_LEN    (10U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_END_MSK    (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R2_END_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R2_END_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_END_UMSK   (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R2_END_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R2_END_POS))
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_START      TZC_SEC_TZC_OCRAM_TZSRG_R2_START
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_START_POS  (16U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_START_LEN  (10U)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_START_MSK  (((1U << TZC_SEC_TZC_OCRAM_TZSRG_R2_START_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R2_START_POS)
#define TZC_SEC_TZC_OCRAM_TZSRG_R2_START_UMSK (~(((1U << TZC_SEC_TZC_OCRAM_TZSRG_R2_START_LEN) - 1) << TZC_SEC_TZC_OCRAM_TZSRG_R2_START_POS))

/* 0x154 : tzc_ocram_tzsrg_r3 */
#define TZC_SEC_TZC_OCRAM_TZSRG_R3_OFFSET (0x154)

/* 0x180 : tzc_wram_tzsrg_ctrl */
#define TZC_SEC_TZC_WRAM_TZSRG_CTRL_OFFSET   (0x180)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_ID_EN      TZC_SEC_TZC_WRAM_TZSRG_R0_ID_EN
#define TZC_SEC_TZC_WRAM_TZSRG_R0_ID_EN_POS  (0U)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_ID_EN_LEN  (4U)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_ID_EN_MSK  (((1U << TZC_SEC_TZC_WRAM_TZSRG_R0_ID_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R0_ID_EN_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R0_ID_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R0_ID_EN_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_R1_ID_EN      TZC_SEC_TZC_WRAM_TZSRG_R1_ID_EN
#define TZC_SEC_TZC_WRAM_TZSRG_R1_ID_EN_POS  (4U)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_ID_EN_LEN  (4U)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_ID_EN_MSK  (((1U << TZC_SEC_TZC_WRAM_TZSRG_R1_ID_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R1_ID_EN_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R1_ID_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R1_ID_EN_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_R2_ID_EN      TZC_SEC_TZC_WRAM_TZSRG_R2_ID_EN
#define TZC_SEC_TZC_WRAM_TZSRG_R2_ID_EN_POS  (8U)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_ID_EN_LEN  (4U)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_ID_EN_MSK  (((1U << TZC_SEC_TZC_WRAM_TZSRG_R2_ID_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R2_ID_EN_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R2_ID_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R2_ID_EN_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_RX_ID_EN      TZC_SEC_TZC_WRAM_TZSRG_RX_ID_EN
#define TZC_SEC_TZC_WRAM_TZSRG_RX_ID_EN_POS  (12U)
#define TZC_SEC_TZC_WRAM_TZSRG_RX_ID_EN_LEN  (4U)
#define TZC_SEC_TZC_WRAM_TZSRG_RX_ID_EN_MSK  (((1U << TZC_SEC_TZC_WRAM_TZSRG_RX_ID_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_RX_ID_EN_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_RX_ID_EN_UMSK (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_RX_ID_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_RX_ID_EN_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_R0_EN         TZC_SEC_TZC_WRAM_TZSRG_R0_EN
#define TZC_SEC_TZC_WRAM_TZSRG_R0_EN_POS     (16U)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_EN_LEN     (1U)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_EN_MSK     (((1U << TZC_SEC_TZC_WRAM_TZSRG_R0_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R0_EN_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_EN_UMSK    (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R0_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R0_EN_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_R1_EN         TZC_SEC_TZC_WRAM_TZSRG_R1_EN
#define TZC_SEC_TZC_WRAM_TZSRG_R1_EN_POS     (17U)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_EN_LEN     (1U)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_EN_MSK     (((1U << TZC_SEC_TZC_WRAM_TZSRG_R1_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R1_EN_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_EN_UMSK    (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R1_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R1_EN_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_R2_EN         TZC_SEC_TZC_WRAM_TZSRG_R2_EN
#define TZC_SEC_TZC_WRAM_TZSRG_R2_EN_POS     (18U)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_EN_LEN     (1U)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_EN_MSK     (((1U << TZC_SEC_TZC_WRAM_TZSRG_R2_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R2_EN_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_EN_UMSK    (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R2_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R2_EN_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_RX_EN         TZC_SEC_TZC_WRAM_TZSRG_RX_EN
#define TZC_SEC_TZC_WRAM_TZSRG_RX_EN_POS     (19U)
#define TZC_SEC_TZC_WRAM_TZSRG_RX_EN_LEN     (1U)
#define TZC_SEC_TZC_WRAM_TZSRG_RX_EN_MSK     (((1U << TZC_SEC_TZC_WRAM_TZSRG_RX_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_RX_EN_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_RX_EN_UMSK    (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_RX_EN_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_RX_EN_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_R0_LOCK       TZC_SEC_TZC_WRAM_TZSRG_R0_LOCK
#define TZC_SEC_TZC_WRAM_TZSRG_R0_LOCK_POS   (20U)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_LOCK_LEN   (1U)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_LOCK_MSK   (((1U << TZC_SEC_TZC_WRAM_TZSRG_R0_LOCK_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R0_LOCK_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R0_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R0_LOCK_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R0_LOCK_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_R1_LOCK       TZC_SEC_TZC_WRAM_TZSRG_R1_LOCK
#define TZC_SEC_TZC_WRAM_TZSRG_R1_LOCK_POS   (21U)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_LOCK_LEN   (1U)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_LOCK_MSK   (((1U << TZC_SEC_TZC_WRAM_TZSRG_R1_LOCK_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R1_LOCK_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R1_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R1_LOCK_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R1_LOCK_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_R2_LOCK       TZC_SEC_TZC_WRAM_TZSRG_R2_LOCK
#define TZC_SEC_TZC_WRAM_TZSRG_R2_LOCK_POS   (22U)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_LOCK_LEN   (1U)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_LOCK_MSK   (((1U << TZC_SEC_TZC_WRAM_TZSRG_R2_LOCK_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R2_LOCK_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_R2_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_R2_LOCK_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_R2_LOCK_POS))
#define TZC_SEC_TZC_WRAM_TZSRG_RX_LOCK       TZC_SEC_TZC_WRAM_TZSRG_RX_LOCK
#define TZC_SEC_TZC_WRAM_TZSRG_RX_LOCK_POS   (23U)
#define TZC_SEC_TZC_WRAM_TZSRG_RX_LOCK_LEN   (1U)
#define TZC_SEC_TZC_WRAM_TZSRG_RX_LOCK_MSK   (((1U << TZC_SEC_TZC_WRAM_TZSRG_RX_LOCK_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_RX_LOCK_POS)
#define TZC_SEC_TZC_WRAM_TZSRG_RX_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_WRAM_TZSRG_RX_LOCK_LEN) - 1) << TZC_SEC_TZC_WRAM_TZSRG_RX_LOCK_POS))

