XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/tzc_sec_reg.h
/* 0xF44 : tzc_se_ctrl_1 */
#define TZC_SEC_TZC_SE_CTRL_1_OFFSET     (0xF44)
#define TZC_SEC_TZC_SF_CR_TZSID_EN       TZC_SEC_TZC_SF_CR_TZSID_EN
#define TZC_SEC_TZC_SF_CR_TZSID_EN_POS   (0U)
#define TZC_SEC_TZC_SF_CR_TZSID_EN_LEN   (2U)
#define TZC_SEC_TZC_SF_CR_TZSID_EN_MSK   (((1U << TZC_SEC_TZC_SF_CR_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_SF_CR_TZSID_EN_POS)
#define TZC_SEC_TZC_SF_CR_TZSID_EN_UMSK  (~(((1U << TZC_SEC_TZC_SF_CR_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_SF_CR_TZSID_EN_POS))
#define TZC_SEC_TZC_SF_SEC_TZSID_EN      TZC_SEC_TZC_SF_SEC_TZSID_EN
#define TZC_SEC_TZC_SF_SEC_TZSID_EN_POS  (2U)
#define TZC_SEC_TZC_SF_SEC_TZSID_EN_LEN  (2U)
#define TZC_SEC_TZC_SF_SEC_TZSID_EN_MSK  (((1U << TZC_SEC_TZC_SF_SEC_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_SF_SEC_TZSID_EN_POS)
#define TZC_SEC_TZC_SF_SEC_TZSID_EN_UMSK (~(((1U << TZC_SEC_TZC_SF_SEC_TZSID_EN_LEN) - 1) << TZC_SEC_TZC_SF_SEC_TZSID_EN_POS))
#define TZC_SEC_TZC_SF_TZSID_CRMD        TZC_SEC_TZC_SF_TZSID_CRMD
#define TZC_SEC_TZC_SF_TZSID_CRMD_POS    (4U)
#define TZC_SEC_TZC_SF_TZSID_CRMD_LEN    (1U)
#define TZC_SEC_TZC_SF_TZSID_CRMD_MSK    (((1U << TZC_SEC_TZC_SF_TZSID_CRMD_LEN) - 1) << TZC_SEC_TZC_SF_TZSID_CRMD_POS)
#define TZC_SEC_TZC_SF_TZSID_CRMD_UMSK   (~(((1U << TZC_SEC_TZC_SF_TZSID_CRMD_LEN) - 1) << TZC_SEC_TZC_SF_TZSID_CRMD_POS))

/* 0xF48 : tzc_se_ctrl_2 */
#define TZC_SEC_TZC_SE_CTRL_2_OFFSET        (0xF48)
#define TZC_SEC_TZC_SE_SHA_TZSID_LOCK       TZC_SEC_TZC_SE_SHA_TZSID_LOCK
#define TZC_SEC_TZC_SE_SHA_TZSID_LOCK_POS   (0U)
#define TZC_SEC_TZC_SE_SHA_TZSID_LOCK_LEN   (1U)
#define TZC_SEC_TZC_SE_SHA_TZSID_LOCK_MSK   (((1U << TZC_SEC_TZC_SE_SHA_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SE_SHA_TZSID_LOCK_POS)
#define TZC_SEC_TZC_SE_SHA_TZSID_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_SE_SHA_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SE_SHA_TZSID_LOCK_POS))
#define TZC_SEC_TZC_SE_AES_TZSID_LOCK       TZC_SEC_TZC_SE_AES_TZSID_LOCK
#define TZC_SEC_TZC_SE_AES_TZSID_LOCK_POS   (1U)
#define TZC_SEC_TZC_SE_AES_TZSID_LOCK_LEN   (1U)
#define TZC_SEC_TZC_SE_AES_TZSID_LOCK_MSK   (((1U << TZC_SEC_TZC_SE_AES_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SE_AES_TZSID_LOCK_POS)
#define TZC_SEC_TZC_SE_AES_TZSID_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_SE_AES_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SE_AES_TZSID_LOCK_POS))
#define TZC_SEC_TZC_SE_TRNG_TZSID_LOCK      TZC_SEC_TZC_SE_TRNG_TZSID_LOCK
#define TZC_SEC_TZC_SE_TRNG_TZSID_LOCK_POS  (2U)
#define TZC_SEC_TZC_SE_TRNG_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_SE_TRNG_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_SE_TRNG_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SE_TRNG_TZSID_LOCK_POS)
#define TZC_SEC_TZC_SE_TRNG_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_SE_TRNG_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SE_TRNG_TZSID_LOCK_POS))
#define TZC_SEC_TZC_SE_PKA_TZSID_LOCK       TZC_SEC_TZC_SE_PKA_TZSID_LOCK
#define TZC_SEC_TZC_SE_PKA_TZSID_LOCK_POS   (3U)
#define TZC_SEC_TZC_SE_PKA_TZSID_LOCK_LEN   (1U)
#define TZC_SEC_TZC_SE_PKA_TZSID_LOCK_MSK   (((1U << TZC_SEC_TZC_SE_PKA_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SE_PKA_TZSID_LOCK_POS)
#define TZC_SEC_TZC_SE_PKA_TZSID_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_SE_PKA_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SE_PKA_TZSID_LOCK_POS))
#define TZC_SEC_TZC_SE_CDET_TZSID_LOCK      TZC_SEC_TZC_SE_CDET_TZSID_LOCK
#define TZC_SEC_TZC_SE_CDET_TZSID_LOCK_POS  (4U)
#define TZC_SEC_TZC_SE_CDET_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_SE_CDET_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_SE_CDET_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SE_CDET_TZSID_LOCK_POS)
#define TZC_SEC_TZC_SE_CDET_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_SE_CDET_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SE_CDET_TZSID_LOCK_POS))
#define TZC_SEC_TZC_SE_GMAC_TZSID_LOCK      TZC_SEC_TZC_SE_GMAC_TZSID_LOCK
#define TZC_SEC_TZC_SE_GMAC_TZSID_LOCK_POS  (5U)
#define TZC_SEC_TZC_SE_GMAC_TZSID_LOCK_LEN  (1U)
#define TZC_SEC_TZC_SE_GMAC_TZSID_LOCK_MSK  (((1U << TZC_SEC_TZC_SE_GMAC_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SE_GMAC_TZSID_LOCK_POS)
#define TZC_SEC_TZC_SE_GMAC_TZSID_LOCK_UMSK (~(((1U << TZC_SEC_TZC_SE_GMAC_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SE_GMAC_TZSID_LOCK_POS))
#define TZC_SEC_TZC_SE_TZSID_CRMD_LOCK      TZC_SEC_TZC_SE_TZSID_CRMD_LOCK
#define TZC_SEC_TZC_SE_TZSID_CRMD_LOCK_POS  (6U)
#define TZC_SEC_TZC_SE_TZSID_CRMD_LOCK_LEN  (1U)
#define TZC_SEC_TZC_SE_TZSID_CRMD_LOCK_MSK  (((1U << TZC_SEC_TZC_SE_TZSID_CRMD_LOCK_LEN) - 1) << TZC_SEC_TZC_SE_TZSID_CRMD_LOCK_POS)
#define TZC_SEC_TZC_SE_TZSID_CRMD_LOCK_UMSK (~(((1U << TZC_SEC_TZC_SE_TZSID_CRMD_LOCK_LEN) - 1) << TZC_SEC_TZC_SE_TZSID_CRMD_LOCK_POS))
#define TZC_SEC_TZC_SF_CR_TZSID_LOCK        TZC_SEC_TZC_SF_CR_TZSID_LOCK
#define TZC_SEC_TZC_SF_CR_TZSID_LOCK_POS    (16U)
#define TZC_SEC_TZC_SF_CR_TZSID_LOCK_LEN    (1U)
#define TZC_SEC_TZC_SF_CR_TZSID_LOCK_MSK    (((1U << TZC_SEC_TZC_SF_CR_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_CR_TZSID_LOCK_POS)
#define TZC_SEC_TZC_SF_CR_TZSID_LOCK_UMSK   (~(((1U << TZC_SEC_TZC_SF_CR_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_CR_TZSID_LOCK_POS))
#define TZC_SEC_TZC_SF_SEC_TZSID_LOCK       TZC_SEC_TZC_SF_SEC_TZSID_LOCK
#define TZC_SEC_TZC_SF_SEC_TZSID_LOCK_POS   (17U)
#define TZC_SEC_TZC_SF_SEC_TZSID_LOCK_LEN   (1U)
#define TZC_SEC_TZC_SF_SEC_TZSID_LOCK_MSK   (((1U << TZC_SEC_TZC_SF_SEC_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_SEC_TZSID_LOCK_POS)
#define TZC_SEC_TZC_SF_SEC_TZSID_LOCK_UMSK  (~(((1U << TZC_SEC_TZC_SF_SEC_TZSID_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_SEC_TZSID_LOCK_POS))
#define TZC_SEC_TZC_SF_TZSID_CRMD_LOCK      TZC_SEC_TZC_SF_TZSID_CRMD_LOCK
#define TZC_SEC_TZC_SF_TZSID_CRMD_LOCK_POS  (18U)
#define TZC_SEC_TZC_SF_TZSID_CRMD_LOCK_LEN  (1U)
#define TZC_SEC_TZC_SF_TZSID_CRMD_LOCK_MSK  (((1U << TZC_SEC_TZC_SF_TZSID_CRMD_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_TZSID_CRMD_LOCK_POS)
#define TZC_SEC_TZC_SF_TZSID_CRMD_LOCK_UMSK (~(((1U << TZC_SEC_TZC_SF_TZSID_CRMD_LOCK_LEN) - 1) << TZC_SEC_TZC_SF_TZSID_CRMD_LOCK_POS))

struct tzc_sec_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[64];

    /* 0x40 : tzc_rom_tzsrg_ctrl */
    union {
        struct {
            uint32_t tzc_rom_tzsrg_r0_id_en : 2;  /* [ 1: 0],        r/w,        0x3 */
            uint32_t tzc_rom_tzsrg_r1_id_en : 2;  /* [ 3: 2],        r/w,        0x3 */
            uint32_t tzc_rom_tzsrg_r2_id_en : 2;  /* [ 5: 4],        r/w,        0x3 */
            uint32_t reserved_6_15          : 10; /* [15: 6],       rsvd,        0x0 */
            uint32_t tzc_rom_tzsrg_r0_en    : 1;  /* [   16],        r/w,        0x0 */
            uint32_t tzc_rom_tzsrg_r1_en    : 1;  /* [   17],        r/w,        0x0 */
            uint32_t tzc_rom_tzsrg_r2_en    : 1;  /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_23         : 5;  /* [23:19],       rsvd,        0x0 */
            uint32_t tzc_rom_tzsrg_r0_lock  : 1;  /* [   24],        r/w,        0x0 */
            uint32_t tzc_rom_tzsrg_r1_lock  : 1;  /* [   25],        r/w,        0x0 */
            uint32_t tzc_rom_tzsrg_r2_lock  : 1;  /* [   26],        r/w,        0x0 */
            uint32_t reserved_27            : 1;  /* [   27],       rsvd,        0x0 */
            uint32_t tzc_sboot_done         : 4;  /* [31:28],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_rom_tzsrg_ctrl;

    /* 0x44 : tzc_rom_tzsrg_adr_mask */
    union {
        struct {
            uint32_t tzc_rom_tzsrg_adr_mask      : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15              : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_rom_tzsrg_adr_mask_lock : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31              : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_rom_tzsrg_adr_mask;

    /* 0x48 : tzc_rom_tzsrg_r0 */
    union {
        struct {
            uint32_t tzc_rom_tzsrg_r0_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15         : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_rom_tzsrg_r0_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31         : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_rom_tzsrg_r0;

    /* 0x4C : tzc_rom_tzsrg_r1 */
    union {
        struct {
            uint32_t tzc_rom_tzsrg_r1_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15         : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_rom_tzsrg_r1_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31         : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_rom_tzsrg_r1;

    /* 0x50 : tzc_rom_tzsrg_r2 */
    union {
        struct {
            uint32_t tzc_rom_tzsrg_r2_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15         : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_rom_tzsrg_r2_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31         : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_rom_tzsrg_r2;

    /* 0x54 : tzc_rom_tzsrg_r3 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_rom_tzsrg_r3;

