XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/tzc_sec_reg.h
    /* 0x14C : tzc_ocram_tzsrg_r1 */
    union {
        struct {
            uint32_t tzc_ocram_tzsrg_r1_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15           : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_ocram_tzsrg_r1_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31           : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_ocram_tzsrg_r1;

    /* 0x150 : tzc_ocram_tzsrg_r2 */
    union {
        struct {
            uint32_t tzc_ocram_tzsrg_r2_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15           : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_ocram_tzsrg_r2_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31           : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_ocram_tzsrg_r2;

    /* 0x154 : tzc_ocram_tzsrg_r3 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_ocram_tzsrg_r3;

    /* 0x158  reserved */
    uint8_t RESERVED0x158[40];

    /* 0x180 : tzc_wram_tzsrg_ctrl */
    union {
        struct {
            uint32_t tzc_wram_tzsrg_r0_id_en : 4; /* [ 3: 0],        r/w,        0xf */
            uint32_t tzc_wram_tzsrg_r1_id_en : 4; /* [ 7: 4],        r/w,        0xf */
            uint32_t tzc_wram_tzsrg_r2_id_en : 4; /* [11: 8],        r/w,        0xf */
            uint32_t tzc_wram_tzsrg_rx_id_en : 4; /* [15:12],        r/w,        0xf */
            uint32_t tzc_wram_tzsrg_r0_en    : 1; /* [   16],        r/w,        0x0 */
            uint32_t tzc_wram_tzsrg_r1_en    : 1; /* [   17],        r/w,        0x0 */
            uint32_t tzc_wram_tzsrg_r2_en    : 1; /* [   18],        r/w,        0x0 */
            uint32_t tzc_wram_tzsrg_rx_en    : 1; /* [   19],        r/w,        0x0 */
            uint32_t tzc_wram_tzsrg_r0_lock  : 1; /* [   20],        r/w,        0x0 */
            uint32_t tzc_wram_tzsrg_r1_lock  : 1; /* [   21],        r/w,        0x0 */
            uint32_t tzc_wram_tzsrg_r2_lock  : 1; /* [   22],        r/w,        0x0 */
            uint32_t tzc_wram_tzsrg_rx_lock  : 1; /* [   23],        r/w,        0x0 */
            uint32_t reserved_24_31          : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_wram_tzsrg_ctrl;

    /* 0x184 : tzc_wram_tzsrg_adr_mask */
    union {
        struct {
            uint32_t tzc_wram_tzsrg_adr_mask      : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15               : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_wram_tzsrg_adr_mask_lock : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31               : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_wram_tzsrg_adr_mask;

    /* 0x188 : tzc_wram_tzsrg_r0 */
    union {
        struct {
            uint32_t tzc_wram_tzsrg_r0_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15          : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_wram_tzsrg_r0_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31          : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_wram_tzsrg_r0;

    /* 0x18C : tzc_wram_tzsrg_r1 */
    union {
        struct {
            uint32_t tzc_wram_tzsrg_r1_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15          : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_wram_tzsrg_r1_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31          : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_wram_tzsrg_r1;

    /* 0x190 : tzc_wram_tzsrg_r2 */
    union {
        struct {
            uint32_t tzc_wram_tzsrg_r2_end   : 10; /* [ 9: 0],        r/w,      0x3ff */
            uint32_t reserved_10_15          : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_wram_tzsrg_r2_start : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_31          : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_wram_tzsrg_r2;

    /* 0x194 : tzc_wram_tzsrg_r3 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_wram_tzsrg_r3;

    /* 0x198 : tzc_wifi_dbg */
    union {
        struct {
            uint32_t tzc_mac_dbg_dis : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_31   : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_wifi_dbg;

    /* 0x19c  reserved */
    uint8_t RESERVED0x19c[164];

    /* 0x240 : tzc_pdm_ctrl */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_pdm_ctrl;

    /* 0x244 : tzc_uart_ctrl */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_uart_ctrl;

    /* 0x248 : tzc_i2c_ctrl */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_i2c_ctrl;

    /* 0x24C : tzc_timer_ctrl */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_timer_ctrl;

    /* 0x250 : tzc_i2s_ctrl */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_i2s_ctrl;

    /* 0x254  reserved */
    uint8_t RESERVED0x254[44];

    /* 0x280 : tzc_sf_tzsrg_ctrl */
    union {
        struct {
            uint32_t tzc_sf_tzsrg_r0_id_en : 4; /* [ 3: 0],        r/w,        0xf */
            uint32_t tzc_sf_tzsrg_r1_id_en : 4; /* [ 7: 4],        r/w,        0xf */
            uint32_t tzc_sf_tzsrg_r2_id_en : 4; /* [11: 8],        r/w,        0xf */
            uint32_t tzc_sf_tzsrg_r3_id_en : 4; /* [15:12],        r/w,        0xf */
            uint32_t tzc_sf_tzsrg_rx_id_en : 4; /* [19:16],        r/w,        0xf */
            uint32_t tzc_sf_tzsrg_r0_en    : 1; /* [   20],        r/w,        0x0 */
            uint32_t tzc_sf_tzsrg_r1_en    : 1; /* [   21],        r/w,        0x0 */
            uint32_t tzc_sf_tzsrg_r2_en    : 1; /* [   22],        r/w,        0x0 */
            uint32_t tzc_sf_tzsrg_r3_en    : 1; /* [   23],        r/w,        0x0 */
            uint32_t tzc_sf_tzsrg_rx_en    : 1; /* [   24],        r/w,        0x0 */
            uint32_t tzc_sf_tzsrg_r0_lock  : 1; /* [   25],        r/w,        0x0 */
            uint32_t tzc_sf_tzsrg_r1_lock  : 1; /* [   26],        r/w,        0x0 */
            uint32_t tzc_sf_tzsrg_r2_lock  : 1; /* [   27],        r/w,        0x0 */
            uint32_t tzc_sf_tzsrg_r3_lock  : 1; /* [   28],        r/w,        0x0 */
            uint32_t tzc_sf_tzsrg_rx_lock  : 1; /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31        : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_sf_tzsrg_ctrl;

    /* 0x284 : tzc_sf_tzsrg_adr_mask */
    union {
        struct {
            uint32_t tzc_sf_tzsrg_adr_mask      : 19; /* [18: 0],        r/w,        0x0 */
            uint32_t reserved_19_30             : 12; /* [30:19],       rsvd,        0x0 */
            uint32_t tzc_sf_tzsrg_adr_mask_lock : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_sf_tzsrg_adr_mask;

    /* 0x288 : tzc_sf_tzsrg_r0 */
    union {
        struct {
            uint32_t tzc_sf_tzsrg_r0_end   : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t tzc_sf_tzsrg_r0_start : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_sf_tzsrg_r0;

    /* 0x28C : tzc_sf_tzsrg_r1 */
    union {
        struct {
            uint32_t tzc_sf_tzsrg_r1_end   : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t tzc_sf_tzsrg_r1_start : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_sf_tzsrg_r1;

    /* 0x290 : tzc_sf_tzsrg_r2 */
    union {
        struct {
            uint32_t tzc_sf_tzsrg_r2_end   : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t tzc_sf_tzsrg_r2_start : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_sf_tzsrg_r2;

