XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/tzc_sec_reg.h
    /* 0x294 : tzc_sf_tzsrg_r3 */
    union {
        struct {
            uint32_t tzc_sf_tzsrg_r3_end   : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t tzc_sf_tzsrg_r3_start : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_sf_tzsrg_r3;

    /* 0x298 : tzc_sf_tzsrg_msb */
    union {
        struct {
            uint32_t tzc_sf_tzsrg_r0_end_msb   : 3; /* [ 2: 0],        r/w,        0x0 */
            uint32_t reserved_3                : 1; /* [    3],       rsvd,        0x0 */
            uint32_t tzc_sf_tzsrg_r0_start_msb : 3; /* [ 6: 4],        r/w,        0x0 */
            uint32_t reserved_7                : 1; /* [    7],       rsvd,        0x0 */
            uint32_t tzc_sf_tzsrg_r1_end_msb   : 3; /* [10: 8],        r/w,        0x0 */
            uint32_t reserved_11               : 1; /* [   11],       rsvd,        0x0 */
            uint32_t tzc_sf_tzsrg_r1_start_msb : 3; /* [14:12],        r/w,        0x0 */
            uint32_t reserved_15               : 1; /* [   15],       rsvd,        0x0 */
            uint32_t tzc_sf_tzsrg_r2_end_msb   : 3; /* [18:16],        r/w,        0x0 */
            uint32_t reserved_19               : 1; /* [   19],       rsvd,        0x0 */
            uint32_t tzc_sf_tzsrg_r2_start_msb : 3; /* [22:20],        r/w,        0x0 */
            uint32_t reserved_23               : 1; /* [   23],       rsvd,        0x0 */
            uint32_t tzc_sf_tzsrg_r3_end_msb   : 3; /* [26:24],        r/w,        0x0 */
            uint32_t reserved_27               : 1; /* [   27],       rsvd,        0x0 */
            uint32_t tzc_sf_tzsrg_r3_start_msb : 3; /* [30:28],        r/w,        0x0 */
            uint32_t reserved_31               : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_sf_tzsrg_msb;

    /* 0x29c  reserved */
    uint8_t RESERVED0x29c[100];

    /* 0x300 : tzc_mm_bmx_tzmid */
    union {
        struct {
            uint32_t tzc_mmcpu_tzmid          : 1;  /* [    0],        r/w,        0x0 */
            uint32_t tzc_blai_tzmid           : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tzc_codec_tzmid          : 1;  /* [    2],        r/w,        0x0 */
            uint32_t tzc_isp_subsys_tzmid     : 1;  /* [    3],        r/w,        0x0 */
            uint32_t tzc_x2ddma_tzmid         : 1;  /* [    4],        r/w,        0x0 */
            uint32_t tzc_xdma_tzmid           : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_15            : 10; /* [15: 6],       rsvd,        0x0 */
            uint32_t tzc_mmcpu_tzmid_sel      : 1;  /* [   16],        r/w,        0x1 */
            uint32_t tzc_blai_tzmid_sel       : 1;  /* [   17],        r/w,        0x1 */
            uint32_t tzc_codec_tzmid_sel      : 1;  /* [   18],        r/w,        0x1 */
            uint32_t tzc_isp_subsys_tzmid_sel : 1;  /* [   19],        r/w,        0x1 */
            uint32_t tzc_x2ddma_tzmid_sel     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t tzc_xdma_tzmid_sel       : 1;  /* [   21],        r/w,        0x1 */
            uint32_t reserved_22_31           : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_mm_bmx_tzmid;

    /* 0x304 : tzc_mm_bmx_tzmid_lock */
    union {
        struct {
            uint32_t tzc_mmcpu_tzmid_lock      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t tzc_blai_tzmid_lock       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tzc_codec_tzmid_lock      : 1;  /* [    2],        r/w,        0x0 */
            uint32_t tzc_isp_subsys_tzmid_lock : 1;  /* [    3],        r/w,        0x0 */
            uint32_t tzc_x2ddma_tzmid_lock     : 1;  /* [    4],        r/w,        0x0 */
            uint32_t tzc_xdma_tzmid_lock       : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31             : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_mm_bmx_tzmid_lock;

    /* 0x308 : tzc_mm_bmx_s0 */
    union {
        struct {
            uint32_t tzc_mmperi_s10_tzsid_en : 2; /* [ 1: 0],        r/w,        0x3 */
            uint32_t tzc_mmperi_s11_tzsid_en : 2; /* [ 3: 2],        r/w,        0x3 */
            uint32_t tzc_mmperi_s12_tzsid_en : 2; /* [ 5: 4],        r/w,        0x3 */
            uint32_t tzc_mmperi_s13_tzsid_en : 2; /* [ 7: 6],        r/w,        0x3 */
            uint32_t tzc_mmperi_s14_tzsid_en : 2; /* [ 9: 8],        r/w,        0x3 */
            uint32_t tzc_mmperi_s15_tzsid_en : 2; /* [11:10],        r/w,        0x3 */
            uint32_t tzc_mmperi_s16_tzsid_en : 2; /* [13:12],        r/w,        0x3 */
            uint32_t tzc_mmperi_s17_tzsid_en : 2; /* [15:14],        r/w,        0x3 */
            uint32_t tzc_mmperi_s18_tzsid_en : 2; /* [17:16],        r/w,        0x3 */
            uint32_t tzc_mmperi_s19_tzsid_en : 2; /* [19:18],        r/w,        0x3 */
            uint32_t tzc_mmperi_s1a_tzsid_en : 2; /* [21:20],        r/w,        0x3 */
            uint32_t tzc_mmperi_s1b_tzsid_en : 2; /* [23:22],        r/w,        0x3 */
            uint32_t tzc_mmperi_s1c_tzsid_en : 2; /* [25:24],        r/w,        0x3 */
            uint32_t tzc_mmperi_s1d_tzsid_en : 2; /* [27:26],        r/w,        0x3 */
            uint32_t tzc_mmperi_s1e_tzsid_en : 2; /* [29:28],        r/w,        0x3 */
            uint32_t tzc_mmperi_s1f_tzsid_en : 2; /* [31:30],        r/w,        0x3 */
        } BF;
        uint32_t WORD;
    } tzc_mm_bmx_s0;

    /* 0x30C : tzc_mm_bmx_s1 */
    union {
        struct {
            uint32_t tzc_isp_s10_tzsid_en : 2; /* [ 1: 0],        r/w,        0x3 */
            uint32_t tzc_isp_s11_tzsid_en : 2; /* [ 3: 2],        r/w,        0x3 */
            uint32_t tzc_isp_s12_tzsid_en : 2; /* [ 5: 4],        r/w,        0x3 */
            uint32_t tzc_isp_s13_tzsid_en : 2; /* [ 7: 6],        r/w,        0x3 */
            uint32_t tzc_isp_s14_tzsid_en : 2; /* [ 9: 8],        r/w,        0x3 */
            uint32_t tzc_isp_s15_tzsid_en : 2; /* [11:10],        r/w,        0x3 */
            uint32_t tzc_isp_s16_tzsid_en : 2; /* [13:12],        r/w,        0x3 */
            uint32_t tzc_isp_s17_tzsid_en : 2; /* [15:14],        r/w,        0x3 */
            uint32_t tzc_isp_s18_tzsid_en : 2; /* [17:16],        r/w,        0x3 */
            uint32_t tzc_isp_s19_tzsid_en : 2; /* [19:18],        r/w,        0x3 */
            uint32_t tzc_isp_s1a_tzsid_en : 2; /* [21:20],        r/w,        0x3 */
            uint32_t tzc_isp_s1b_tzsid_en : 2; /* [23:22],        r/w,        0x3 */
            uint32_t tzc_isp_s1c_tzsid_en : 2; /* [25:24],        r/w,        0x3 */
            uint32_t tzc_isp_s1d_tzsid_en : 2; /* [27:26],        r/w,        0x3 */
            uint32_t tzc_isp_s1e_tzsid_en : 2; /* [29:28],        r/w,        0x3 */
            uint32_t tzc_isp_s1f_tzsid_en : 2; /* [31:30],        r/w,        0x3 */
        } BF;
        uint32_t WORD;
    } tzc_mm_bmx_s1;

    /* 0x310 : tzc_mm_bmx_s2 */
    union {
        struct {
            uint32_t tzc_codec_s10_tzsid_en : 2; /* [ 1: 0],        r/w,        0x3 */
            uint32_t tzc_codec_s11_tzsid_en : 2; /* [ 3: 2],        r/w,        0x3 */
            uint32_t tzc_codec_s12_tzsid_en : 2; /* [ 5: 4],        r/w,        0x3 */
            uint32_t tzc_codec_s13_tzsid_en : 2; /* [ 7: 6],        r/w,        0x3 */
            uint32_t tzc_codec_s14_tzsid_en : 2; /* [ 9: 8],        r/w,        0x3 */
            uint32_t tzc_codec_s15_tzsid_en : 2; /* [11:10],        r/w,        0x3 */
            uint32_t tzc_codec_s16_tzsid_en : 2; /* [13:12],        r/w,        0x3 */
            uint32_t tzc_codec_s17_tzsid_en : 2; /* [15:14],        r/w,        0x3 */
            uint32_t tzc_codec_s18_tzsid_en : 2; /* [17:16],        r/w,        0x3 */
            uint32_t tzc_codec_s19_tzsid_en : 2; /* [19:18],        r/w,        0x3 */
            uint32_t tzc_codec_s1a_tzsid_en : 2; /* [21:20],        r/w,        0x3 */
            uint32_t tzc_codec_s1b_tzsid_en : 2; /* [23:22],        r/w,        0x3 */
            uint32_t tzc_codec_s1c_tzsid_en : 2; /* [25:24],        r/w,        0x3 */
            uint32_t tzc_codec_s1d_tzsid_en : 2; /* [27:26],        r/w,        0x3 */
            uint32_t tzc_codec_s1e_tzsid_en : 2; /* [29:28],        r/w,        0x3 */
            uint32_t tzc_codec_s1f_tzsid_en : 2; /* [31:30],        r/w,        0x3 */
        } BF;
        uint32_t WORD;
    } tzc_mm_bmx_s2;

    /* 0x314 : tzc_mm_bmx_s_lock0 */
    union {
        struct {
            uint32_t tzc_mmperi_s10_tzsid_lock : 1;  /* [    0],        r/w,        0x0 */
            uint32_t tzc_mmperi_s11_tzsid_lock : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tzc_mmperi_s12_tzsid_lock : 1;  /* [    2],        r/w,        0x0 */
            uint32_t tzc_mmperi_s13_tzsid_lock : 1;  /* [    3],        r/w,        0x0 */
            uint32_t tzc_mmperi_s14_tzsid_lock : 1;  /* [    4],        r/w,        0x0 */
            uint32_t tzc_mmperi_s15_tzsid_lock : 1;  /* [    5],        r/w,        0x0 */
            uint32_t tzc_mmperi_s16_tzsid_lock : 1;  /* [    6],        r/w,        0x0 */
            uint32_t tzc_mmperi_s17_tzsid_lock : 1;  /* [    7],        r/w,        0x0 */
            uint32_t tzc_mmperi_s18_tzsid_lock : 1;  /* [    8],        r/w,        0x0 */
            uint32_t tzc_mmperi_s19_tzsid_lock : 1;  /* [    9],        r/w,        0x0 */
            uint32_t tzc_mmperi_s1a_tzsid_lock : 1;  /* [   10],        r/w,        0x0 */
            uint32_t tzc_mmperi_s1b_tzsid_lock : 1;  /* [   11],        r/w,        0x0 */
            uint32_t tzc_mmperi_s1c_tzsid_lock : 1;  /* [   12],        r/w,        0x0 */
            uint32_t tzc_mmperi_s1d_tzsid_lock : 1;  /* [   13],        r/w,        0x0 */
            uint32_t tzc_mmperi_s1e_tzsid_lock : 1;  /* [   14],        r/w,        0x0 */
            uint32_t tzc_mmperi_s1f_tzsid_lock : 1;  /* [   15],        r/w,        0x0 */
            uint32_t reserved_16_31            : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_mm_bmx_s_lock0;

    /* 0x318 : tzc_mm_bmx_s_lock1 */
    union {
        struct {
            uint32_t tzc_codec_s10_tzsid_lock : 1; /* [    0],        r/w,        0x0 */
            uint32_t tzc_codec_s11_tzsid_lock : 1; /* [    1],        r/w,        0x0 */
            uint32_t tzc_codec_s12_tzsid_lock : 1; /* [    2],        r/w,        0x0 */
            uint32_t tzc_codec_s13_tzsid_lock : 1; /* [    3],        r/w,        0x0 */
            uint32_t tzc_codec_s14_tzsid_lock : 1; /* [    4],        r/w,        0x0 */
            uint32_t tzc_codec_s15_tzsid_lock : 1; /* [    5],        r/w,        0x0 */
            uint32_t tzc_codec_s16_tzsid_lock : 1; /* [    6],        r/w,        0x0 */
            uint32_t tzc_codec_s17_tzsid_lock : 1; /* [    7],        r/w,        0x0 */
            uint32_t tzc_codec_s18_tzsid_lock : 1; /* [    8],        r/w,        0x0 */
            uint32_t tzc_codec_s19_tzsid_lock : 1; /* [    9],        r/w,        0x0 */
            uint32_t tzc_codec_s1a_tzsid_lock : 1; /* [   10],        r/w,        0x0 */
            uint32_t tzc_codec_s1b_tzsid_lock : 1; /* [   11],        r/w,        0x0 */
            uint32_t tzc_codec_s1c_tzsid_lock : 1; /* [   12],        r/w,        0x0 */
            uint32_t tzc_codec_s1d_tzsid_lock : 1; /* [   13],        r/w,        0x0 */
            uint32_t tzc_codec_s1e_tzsid_lock : 1; /* [   14],        r/w,        0x0 */
            uint32_t tzc_codec_s1f_tzsid_lock : 1; /* [   15],        r/w,        0x0 */
            uint32_t tzc_isp_s10_tzsid_lock   : 1; /* [   16],        r/w,        0x0 */
            uint32_t tzc_isp_s11_tzsid_lock   : 1; /* [   17],        r/w,        0x0 */
            uint32_t tzc_isp_s12_tzsid_lock   : 1; /* [   18],        r/w,        0x0 */
            uint32_t tzc_isp_s13_tzsid_lock   : 1; /* [   19],        r/w,        0x0 */
            uint32_t tzc_isp_s14_tzsid_lock   : 1; /* [   20],        r/w,        0x0 */
            uint32_t tzc_isp_s15_tzsid_lock   : 1; /* [   21],        r/w,        0x0 */
            uint32_t tzc_isp_s16_tzsid_lock   : 1; /* [   22],        r/w,        0x0 */
            uint32_t tzc_isp_s17_tzsid_lock   : 1; /* [   23],        r/w,        0x0 */
            uint32_t tzc_isp_s18_tzsid_lock   : 1; /* [   24],        r/w,        0x0 */
            uint32_t tzc_isp_s19_tzsid_lock   : 1; /* [   25],        r/w,        0x0 */
            uint32_t tzc_isp_s1a_tzsid_lock   : 1; /* [   26],        r/w,        0x0 */
            uint32_t tzc_isp_s1b_tzsid_lock   : 1; /* [   27],        r/w,        0x0 */
            uint32_t tzc_isp_s1c_tzsid_lock   : 1; /* [   28],        r/w,        0x0 */
            uint32_t tzc_isp_s1d_tzsid_lock   : 1; /* [   29],        r/w,        0x0 */
            uint32_t tzc_isp_s1e_tzsid_lock   : 1; /* [   30],        r/w,        0x0 */
            uint32_t tzc_isp_s1f_tzsid_lock   : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_mm_bmx_s_lock1;

    /* 0x31c  reserved */
    uint8_t RESERVED0x31c[36];

    /* 0x340 : tzc_l2sram_tzsrg_ctrl */
    union {
        struct {
            uint32_t tzc_l2sram_tzsrg_r0_id_en : 2;  /* [ 1: 0],        r/w,        0x3 */
            uint32_t tzc_l2sram_tzsrg_r1_id_en : 2;  /* [ 3: 2],        r/w,        0x3 */
            uint32_t tzc_l2sram_tzsrg_r2_id_en : 2;  /* [ 5: 4],        r/w,        0x3 */
            uint32_t reserved_6_15             : 10; /* [15: 6],       rsvd,        0x0 */
            uint32_t tzc_l2sram_tzsrg_r0_en    : 1;  /* [   16],        r/w,        0x0 */
            uint32_t tzc_l2sram_tzsrg_r1_en    : 1;  /* [   17],        r/w,        0x0 */
            uint32_t tzc_l2sram_tzsrg_r2_en    : 1;  /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_23            : 5;  /* [23:19],       rsvd,        0x0 */
            uint32_t tzc_l2sram_tzsrg_r0_lock  : 1;  /* [   24],        r/w,        0x0 */
            uint32_t tzc_l2sram_tzsrg_r1_lock  : 1;  /* [   25],        r/w,        0x0 */
            uint32_t tzc_l2sram_tzsrg_r2_lock  : 1;  /* [   26],        r/w,        0x0 */
            uint32_t reserved_27_31            : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_l2sram_tzsrg_ctrl;

    /* 0x344 : tzc_l2sram_tzsrg_adr_mask */
    union {
        struct {
            uint32_t tzc_l2sram_tzsrg_adr_mask      : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15                 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tzc_l2sram_tzsrg_adr_mask_lock : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_l2sram_tzsrg_adr_mask;

